package com.seavus.practice.newsportal.utility;

import com.seavus.practice.newsportal.models.*;
import com.seavus.practice.newsportal.repositories.*;
import com.seavus.practice.newsportal.repositories.localization.LocaleRepository;
import org.springframework.beans.factory.annotation.Autowired;
import org.springframework.boot.CommandLineRunner;
import org.springframework.stereotype.Component;

import java.util.ArrayList;
import java.util.List;

/**
 * Created by MK on 09.06.2016.
 */
@Component
public class DatabaseLoader implements CommandLineRunner {

    @Autowired
    private final AuthorRepository authorRepository;
    @Autowired
    private final AuthorProfileRepository authorProfileRepository;
    @Autowired
    private final ArticleRepository articleRepository;
    @Autowired
    private final CommentRepository commentRepository;
    @Autowired
    private final TagRepository tagRepository;
    @Autowired
    private final LocaleRepository localeRepository;

    @Autowired
    public DatabaseLoader(AuthorRepository authorRepository,
            AuthorProfileRepository authorProfileRepository,
            ArticleRepository articleRepository,
            CommentRepository commentRepository,
            TagRepository tagRepository,
            LocaleRepository localeRepository) {
        this.authorRepository = authorRepository;
        this.authorProfileRepository = authorProfileRepository;
        this.articleRepository = articleRepository;
        this.commentRepository = commentRepository;
        this.tagRepository = tagRepository;
        this.localeRepository = localeRepository;
    }

    @Override
    public void run(String... strings) throws Exception {
        AuthorProfile authorProfile = new AuthorProfile("testName", "testLogin", "image", null);
        Author author = new Author("author", "password", "GENERAL_USER");
        authorProfile.setAuthor(author);
        authorRepository.save(author);
        authorProfileRepository.save(authorProfile);
        List<Comment> articleComments = new ArrayList<>();
        Article article8 = new Article("Германия крупно обыграла Словакию в 1/8 ЕВРО-2016",
                "Пятый четвертьфиналист Евро-2016 определился в противостоянии действующих чемпионов мира немцев и дебютантов континентального форума словаков.\n"
                + "Матч прошел с колоссальным преимуществом действующих чемпионов мира, которые трижды огорчили вратаря Словакии Матуша Козачика. Голами отметились Жером Боатенг, Марио Гомес и Юлиан Дракслер - 3:0.\n"
                + "Немцы могли победить и с более крупным счетом, но в первом тайме пенальти не реализовал Месут Озил.\n"
                + "В четвертьфинале Германия сыграет с победителем пары Италия - Испания.", authorProfile,
                "http://img.tyt.by/620x620s/n/sport/0d/8/germaniya_slovakiya_1.jpg",
                "Пятый четвертьфиналист Евро-2016 определился в противостоянии действующих чемпионов мира немцев и дебютантов континентального форума словаков.\n"
                + "Матч прошел с колоссальным преимуществом действующих чемпионов мира, которые трижды огорчили вратаря Словакии Матуша Козачика. Голами отметились Жером Боатенг, Марио Гомес и Юлиан Дракслер - 3:0.\n"
        );

        Article article9 = new Article("Ставки на EURO. Выпуск №15. Прогнозы на воскресные матчи 1/8 финала Евро-2016!",
                "«Ставки на EURO» — новый специальный проект о ставках на спорт, посвященный главному футбольному событию года в Европе! Следим за Евро-2016, обсуждаем новости, оцениваем шансы команд и делаем ставки по линии букмекерской конторы ФавБет вместе с известными спортивными журналистами Беларуси!\n"
                + "В пятнадцатый игровой день турнира эксперты делают прогнозы на матчи 1/8 финала «Франция — Ирландия», «Германия — Словакия» и «Венгрия — Бельгия». Посмотрев видео, вы узнаете, на что предлагают поставить эксперты!\n"
                + "Чьи прогнозы вам нравятся больше? А может быть, есть собственное мнение?\n"
                + "Принимайте участие в голосовании по матчам пятнадцатого игрового дня!",
                authorProfile, "https://im0-tub-by.yandex.net/i?id=9bbe04f09b90e95d4e50202841226871&n=33&h=215&w=215",
                "\"«Ставки на EURO» — новый специальный проект о ставках на спорт, посвященный главному футбольному событию года в Европе! Следим за Евро-2016, обсуждаем новости, оцениваем шансы команд и делаем ставки по линии букмекерской конторы ФавБет вместе с известными спортивными журналистами Беларуси!");

        Article article10 = new Article("Моднейший танец на столе Ледли из Уэльса в честь победы над Северной Ирландией",
                "А ты трешься в баре, когда идешь в клуб.\n"
                + "После матча против Северной Ирландии Джо Ледли исполнил победный танец на столе под сингл \n"
                + "We No Speak Americano. Партнеры хлопали в ладоши.",
                authorProfile, "http://i.eurosport.com/2016/06/25/1883588-39667638-2560-1440.jpg?w=1400",
                "После матча против Северной Ирландии Джо Ледли исполнил победный танец на столе под сингл \n");
        Article art1 = new Article("Двойной Успех Итальянцев в Монако", "Субботнее Гран-При Longines Global Champions Tour в Монако завершилось победным дублем \n"
                + "от итальянских всадников, сильнейшим из которых оказался Эмануель Гаудиано.\n"
                + "Отчётный этап стал уже девятым из пятнадцати запланированных к проведению в текущем году,\n"
                + " и, как и многие из предыдущих, он сумел преподнести ряд сюрпризов. К примеру, Кристиан Альманн, \n"
                + "пока ещё сохраняющий лидерство в общем зачёте, уже второй раз финишировал вне очковой зоны, \n"
                + "что помогло его главной преследовательнице в лице Эдвины Топс-Александер\n"
                + " сократить разрыв до сорока очков – цены победы на одном этапе. \n"
                + "Будучи одним из сорока двух участников турнира, немец не сумел преодолеть\n"
                + " препятствия первого гита без ошибок, и был вынужден переквалифицироваться в зрителя. \n"
                + "Уже привычно, восемнадцать сильнейших продолжили борьбу за места во втором гите.\n"
                + " После перерыва практически все исполнители шли на одном уровне и лишь два всадника откровенно провалились.\n"
                + " Марлон Модолло Дзанотелли сбил четыре перекладины, а Одри Каултер – три.\n"
                + " Идущая в текущем рейтинге второй Топс-Александер также остановилась на данном этапе, достигнув лишь одиннадцатой \n"
                + "строчки при четырёх штрафных пунктах и времени в 63.54 секунды. \n"
                + "Десятку же замкнул немец Давид Вилл, который также сбил одну перекладину и завершил выступление\n"
                + " за 62.20 секунды. Девять сильнейших пробились в перепрыжку, оставшись с нулями за первых два гита. \n"
                + "Укороченная дистанция также далась не всем. Как результат, на девятом месте оказался Жером Гери, \n"
                + "получивший девять же очков при времени в 49.53 секунды.",
                authorProfile, "http://i.eurosport.com/2016/06/26/1884271-39681303-2560-1440.jpg?w=1400",
                "Субботнее Гран-При Longines Global Champions Tour в Монако завершилось победным дублем \n"
                + "от итальянских всадников, сильнейшим из которых оказался Эмануель Гаудиано.\n"
                + "Отчётный этап стал уже девятым из пятнадцати запланированных к проведению в текущем году");
        Article art2 = new Article("Как Гризманн перевернул матч, планету и вообще все за четыре минуты",
                "Француз сотворил два гола на 57-й и 61-й минутах матча и вывел Францию в четвертьфинал.\n"
                + "Хозяева турнира пропустили гол на второй минуте матча. Отличился Роберт Брэйди с пенальти.\n"
                + "Французы пытались забить почти час, но все как-то нет. Тогда Антуан Гризманн прыгнул и сравнял счет ударом головой.",
                authorProfile, "http://rubuzz.wordpress.eurosport.com/wp-content/uploads/sites/10/2016/06/%D0%93%D1%80%D0%B8%D0%B7%D0%BC%D0%B0%D0%BD%D0%BD-1170x658.jpg",
                "Француз сотворил два гола на 57-й и 61-й минутах матча и вывел Францию в четвертьфинал.\n");
        Article art3 = new Article("Суботич объявил об уходе из дортмундской «Боруссии»", "Защитник попрощался с болельщиками команды.\n"
                + "«Дорогие друзья. В прошлом сезоне я осознал, что моя любовь к футболу и к участию в игре слишком велика,\n"
                + " чтобы наблюдать за этим со стороны. Футбол – важная часть моей жизни, я очень люблю его и без него\n"
                + " я бы не был самим собой. Сейчас я в идеальном для футболиста возрасте и хочу использовать это время,\n"
                + " чтобы вести свою команду вперед. Хочу чувствовать себя востребованным и отдавать все команде.\n"
                + " Я не хочу зарабатывать деньги, сидя на скамейке запасных. Надеюсь, вы поймете.\n"
                + " «Боруссия» в моем сердце и всегда там будет. Ваш Невен», – написал Суботич в фейсбуке.",
                authorProfile, "https://scontent-waw1-1.xx.fbcdn.net/v/t1.0-0/s552x414/13532788_826432890790718_2188201641466222681_n.jpg?oh=5735ca2a02e5eea313dfe933b8ef0c5e&oe=57F8F76A",
                "Защитник попрощался с болельщиками команды.\n");
        Article art4 = new Article("Скончался советский и белорусский актер Ростислав Янковский",
                "В Минске в возрасте 86 лет скончался народный артист СССР \n"
                + "Ростислав Янковский. В Национальном академическом драматическом \n"
                + "театре имени М. Горького, где во вторник пройдет гражданская панихида,\n"
                + " заявили об огромной потере для искусства. Ростислав Янковский являлся \n"
                + "старшим братом знаменитого актера Олега Янковского.",
                authorProfile, "http://www.mk.ru/upload/entities/2016/06/26/articles/detailPicture/1c/51/49/939765092_7680201.jpg",
                "В Минске в возрасте 86 лет скончался народный артист СССР \n"
                + "Ростислав Янковский. В Национальном академическом драматическом \n"
                + "театре имени М. Горького, где во вторник пройдет гражданская панихида,\n");
        Article art5 = new Article("В парке «Садовники» художники накормили посетителей деревянными арбузами",
                "Пока москвичи уезжают на выходные за город,\n"
                + " художники проводят в столице субботники, причем не по уборке территории, \n"
                + "а по ее благоустройству. После нынешнего уик-энда в парке «Садовники» останутся \n"
                + "«Рабочий и колхозница» из строительных носилок, ванна с веслами, памятник граблям, \n"
                + "летняя кухня из столовых приборов, клумба с душевыми лейками и даже кровати.",
                authorProfile, "http://www.mk.ru/upload/entities/2016/06/26/articles/detailPicture/b5/bc/6f/bd0171653_3053181.jpg",
                "Пока москвичи уезжают на выходные за город,\n"
                + " художники проводят в столице субботники, причем не по уборке территории, \n"
                + "а по ее благоустройству.");
        Article art6 = new Article("Мария Максакова исполнила «В Питере – пить»",
                "Некоторым кажется, будто в культурной жизни \n"
                + "России наступила тоскливая пауза. Нет премьер, \n"
                + "ничего не происходит. Но на безрыбье и рак — рыба. \n"
                + "Солистка Мариинской оперы, депутат Госдумы Мария Максакова спела в автомобильном караоке хит \n"
                + "«В Питере — пить» группы «Ленинград» и взорвала записью этого выступления интернет.",
                authorProfile, "http://www.mk.ru/upload/entities/2016/06/24/articles/detailPicture/05/11/8c/801849658_5367508.jpg",
                "Некоторым кажется, будто в культурной жизни \n"
                + "России наступила тоскливая пауза. Нет премьер, \n"
                + "ничего не происходит. Но на безрыбье и рак — рыба. \n");
        Article art7 = new Article("Джигарханян сделал капремонт", "И в 80 Армен Джигарханян работает, как всю жизнь привык, в тонусе, чтоб не сойти с дистанции.\n"
                + " Снимается, ставит спектакли в своем театре, регулярно дает репетиции. Сейчас вот открывает после ремонта Малую\n"
                + " сцену на Кооперативной улице. И вот новенькое, с иголочки театральное пространство 24 июня приняло артистов, \n"
                + "журналистов, друзей и показалось им во всей красе.", authorProfile,
                "http://www.mk.ru/upload/entities/2016/06/24/articles/detailPicture/aa/83/c7/e56229609_8079823.jpg",
                "И в 80 Армен Джигарханян работает, как всю жизнь привык, в тонусе, чтоб не сойти с дистанции.\n"
                + " Снимается, ставит спектакли в своем театре, регулярно дает репетиции.");
        Article art8 = new Article("Шкатулку Путина показали во дворце", "Знали, что у Владимира Путина, королевы Великобритании Елизаветы II, \n"
                + "принца Уильяма и Кейт Миддлтон есть шкатулки, причем федоскинские? До ноября их можно \n"
                + "увидеть в Коломенском, во дворце Алексея Михайловича, который превратили в площадку мировых \n"
                + "центров лаковой миниатюрной живописи. География их — от Англии до Японии. Впервые собрали 800 \n"
                + "произведений искусства для одной выставки, где особым вниманием пользуются шкатулки из Федоскина.",
                authorProfile, "http://www.mk.ru/upload/entities/2016/06/24/articles/detailPicture/44/55/cd/504497784_4754053.jpg",
                "Знали, что у Владимира Путина, королевы Великобритании Елизаветы II, \n"
                + "принца Уильяма и Кейт Миддлтон есть шкатулки, причем федоскинские? До ноября их можно \n"
                + "увидеть в Коломенском, во дворце Алексея Михайловича, который превратили в площадку мировых \n"
                + "центров лаковой миниатюрной живописи. География их — от Англии до Японии.");
        Article art9 = new Article("Анна Матисон: до и после \"Сатисфакции\"", "С режиссером и сценаристом Анной Матисон мы встретились в Сочи на фестивале «Кинотавр»,\n"
                + " где она вместе с мужем Сергеем Безруковым представляла свой третий игровой фильм «После тебя». \n"
                + "Сергей стал продюсером картины и сыграл знаменитого артиста балета Алексея Темникова,\n"
                + " чья карьера неожиданно оборвалась.", authorProfile,
                "http://www.mk.ru/upload/entities/2016/06/24/articles/detailPicture/2d/4d/fb/516295903_4074386.jpg",
                "С режиссером и сценаристом Анной Матисон мы встретились в Сочи на фестивале «Кинотавр»,\n"
                + " где она вместе с мужем Сергеем Безруковым представляла свой третий игровой фильм «После тебя». \n");
        Article art10 = new Article("Все секреты приготовления идеального шашлыка",
                "Мясо с дымком, зажаренное на углях на свежем воздухе в хорошей компании — это ли не мечта горожанина,\n"
                + " когда наступают теплые деньки! Упоительный аромат шашлыков уже с середины апреля стоит над парками \n"
                + "Москвы каждые выходные.\n"
                + "Чтобы ваш шашлык получился самым вкусным, «МИР 24» публикует лучшие рецепты шашлыков - традиционных и не очень.\n"
                + "Важные мелочи для великолепного шашлыка\n"
                + "Мангал\n"
                + "Мангал не должен быть слишком глубоким. Недорогие сборные мангалы, продающиеся в любом супермаркете,\n"
                + " может быть, и не так долговечны, как кованые стационарные, но довольно хорошо рассчитаны по глубине.\n"
                + "Уголь надо засыпать примерно на треть глубины мангала.\n"
                + " Так, чтобы от поверхности углей до шашлыка было не более 12 сантиметров.\n"
                + " Близость углей к мясу — залог его сочности и прожаренности.",
                authorProfile, "http://mir24.tv/media/images/uploaded/inner10023532.jpg",
                "Мясо с дымком, зажаренное на углях на свежем воздухе в хорошей компании — это ли не мечта горожанина,\n"
                + " когда наступают теплые деньки! Упоительный аромат шашлыков уже с середины апреля стоит над парками \n"
                + "Москвы каждые выходные.\n"
                + "Чтобы ваш шашлык получился самым вкусным, «МИР 24» публикует лучшие рецепты шашлыков - традиционных и не очень.\n"
                + "Важные мелочи для великолепного шашлыка\n");
        Article art11 = new Article("Евро-2016: чего стоило простым россиянам попасть на матч",
                "Минимальная сумма, в которую мог уложиться российский болельщик, отправившийся на чемпионат Европы по футболу\n"
                + " – €625. Это если посещать один матч, покупать самый дешевый билет и ночевать в недорогой гостинице.\n"
                + "В бюджет вошло оформление шенгенской визы – €35, \n"
                + "перелет до Марселя со стыковкой в Париже на даты проведения чемпионата – минимум €350, \n"
                + "отель – €215 за ночь и сам билет на матч – минимум €25 (это если покупать заранее в самый дешевый сектор).",
                authorProfile, "http://mir24.tv/media/images/uploaded/inner14596698.jpg",
                "Минимальная сумма, в которую мог уложиться российский болельщик, отправившийся на чемпионат Европы по футболу\n"
                + " – €625. Это если посещать один матч, покупать самый дешевый билет и ночевать в недорогой гостинице.\n"
                + "В бюджет вошло оформление шенгенской визы – €35, \n");
        Article art12 = new Article("Самый древний античный храм в России нашли под Краснодаром",
                "Ученые нашли на территории Краснодарского края самый древний античный храм в России, передает ТАСС.\n"
                + "По данным в пресс-службы фонда Олега Дерипаски «Вольное дело», уникальное сооружение \n"
                + "нашли прямо под фундаментом обнаруженного в 2013 году храма V века до н.э. Оказалось, \n"
                + "что строение было возведено над остатками его древнего предшественника, так называемого «храма в антах». \n"
                + "Это тип сооружения древнейшей эпохи, антами называются выступы продольных стен, которые окаймляли вход.\n"
                + "Находку обнаружили в центральной части Фанагории на раскопе «Верхний город»,\n"
                + " в котором в древности находился общественный и политический центр города – акрополь.",
                authorProfile, "http://mir24.tv/media/images/uploaded/inner10933580.jpg",
                "Ученые нашли на территории Краснодарского края самый древний античный храм в России, передает ТАСС.\n"
                + "По данным в пресс-службы фонда Олега Дерипаски «Вольное дело», уникальное сооружение \n"
                + "нашли прямо под фундаментом обнаруженного в 2013 году храма V века до н.э. ");
        Article art13 = new Article("Опасные хозяева элитных BMW", "Жителям Москвы и Петербурга, видимо, \n"
                + "теперь следует опасаться владельцев дорогих автомобилей представительского \n"
                + "класса BMW седьмой серии. Недавние случаи, произошедшие в двух российских столицах с их участием, \n"
                + "заставляют задуматься о своей безопасности, пишет «Ридус».\n"
                + "Так, накануне Интернет взорвала новость о том, что пассажир BMW седьмой серии с\n"
                + " госномерами серии АМР напал на девушку в центре Москвы. Ему не понравилось, \n"
                + "что случайная прохожая снимала на камеру нарушения, допущенные водителем иномарки. \n"
                + "К слову, автомобиль двигался по пешеходной зоне Старого Арбата. Мужчина, вышедший из автомобиля, \n"
                + "напал на девушку и разбил ее телефон.", authorProfile,
                "http://minsk.freeads.by/content/root/users/2011/20111226/visitor/images/201112/f20111226084959-prokat-bmw-e60-1.jpg",
                "Жителям Москвы и Петербурга, видимо, \n"
                + "теперь следует опасаться владельцев дорогих автомобилей представительского \n"
                + "класса BMW седьмой серии. Недавние случаи, произошедшие в двух российских столицах с их участием, \n"
                + "заставляют задуматься о своей безопасности, пишет «Ридус».\n");
        Article art14 = new Article("Безопасный отдых: куда не страшно отправить детей на лето",
                "По всей России проходят тотальные проверки лагерей. \n"
                + "Некоторые родители паникуют и забирают своих детей, не дожидаясь окончания смены.\n"
                + " Однако не все так плохо. Корреспондент телеканала «МИР 24» Ирина Кузьминская побывала на Валдае и убедилась:\n"
                + " безопасный детский отдых существует.\n"
                + "Их учат лазить по деревьям, ставить палатки, разводить костер. \n"
                + "Но главная «фишка» этого лагеря - водные походы. Прежде чем спустить весла, \n"
                + "все отрабатывают на берегу.\n"
                + "«Мы должны застегнуть спасательные жилеты на три защелки, но еще нужно\n"
                + " подстраховаться и затянуть эту лямку», - говорит инструктор Владимир Дубовик.", authorProfile,
                "http://mir24.tv/media/images/uploaded/inner11349347.jpg",
                "По всей России проходят тотальные проверки лагерей. \n"
                + "Некоторые родители паникуют и забирают своих детей, не дожидаясь окончания смены.\n"
                + " Однако не все так плохо. Корреспондент телеканала «МИР 24» Ирина Кузьминская побывала на Валдае и убедилась:\n"
                + " безопасный детский отдых существует.\n");
        Article art15 = new Article("Как окружающие воспринимают накрашенных женщин",
                "Шотландские ученые из института Стерлинга провели исследование, посвященное восприятию женского макияжа,\n"
                + " пишут зарубежные СМИ. Результаты исследования показали, что мужчины воспринимают накрашенных женщин\n"
                + " как более престижных, в то время как женщины считают их более властными и жесткими.\n"
                + "Виктория Милева, руководившая работой, отмечает, что оба пола считают женщин с макияжем\n"
                + " более привлекательными для мужчин. Однако отношение женщин к другим женщинам, использующим макияж, \n"
                + "достаточно негативное. Скорее всего, это вызвано завистью и страхом «проиграть» накрашенным, а значит, \n"
                + "с точки зрения женщин, более привлекательным конкуренткам.\n"
                + "Считается, что макияж и маникюр могут многое рассказать о характере женщины.\n"
                + " Например, длинные ногти указывают на стервозность и капризность дамы. \n"
                + "Красный цвет лака указывает на ее эмоциональность, тогда как светлые тона лака \n"
                + "говорят о романтичной, ранимой и женственной натуре. Женщины, принципиально \n"
                + "не красящие ногти, по мнению некоторых психологов, являются более цельными и самодостаточными личностями.",
                authorProfile, "http://www.bagnet.org/storage/30/05/05/25/729_486_560d9429618db.jpg",
                "Шотландские ученые из института Стерлинга провели исследование, посвященное восприятию женского макияжа,\n"
                + " пишут зарубежные СМИ. Результаты исследования показали, что мужчины воспринимают накрашенных женщин\n"
                + " как более престижных, в то время как женщины считают их более властными и жесткими.\n"
                + "Виктория Милева, руководившая работой, отмечает, что оба пола считают женщин с макияжем\n"
                + " более привлекательными для мужчин. Однако отношение женщин к другим женщинам, использующим макияж, \n"
                + "достаточно негативное. Скорее всего, это вызвано завистью и страхом «проиграть» накрашенным, а значит, \n"
                + "с точки зрения женщин, более привлекательным конкуренткам.\n");
        Article politica1 = new Article("Встреча омбудсменов России и Украины может состояться до конца июня",
                "Встреча уполномоченного по правам человека в РФ Татьяны Москальковой с украинской коллегой Валерией \n"
                + "Лутковской может пройти ещё до конца июня, как ожидается, в рамках встречи российский и украинский \n"
                + "омбудсмены обсудят взаимодействие по гуманитарным вопросам, в том числе, по вопросу перемещения \n"
                + "заключенных украинских граждан из Крыма на Украину. Об этом РИА Новости сообщила российский уполномоченный.\n"
                + "Омбудсмен подчеркнула, что \"права граждан не имеют политической окраски и границ\", и важно выработать такие пути взаимодействия, которые бы позволяли поднять \n"
                + "на более высокий уровень защиту прав и интересов граждан.\n"
                + "\"На сегодняшний день акты гражданского состояния, заключенные в России, не все признаются на Украине. Очень важно, чтобы свидетельства о браке, о смерти, о наследовании взаимно признавались, и чтобы люди не страдали от тех политических проблем, которые сегодня существуют между государствами. Мне кажется, важными должны оставаться и вопросы, связанные с образовательной темой, \n"
                + "с медицинским обеспечением, с воссоединением семей\", — добавила она.", authorProfile,
                "http://cdn12.img22.ria.ru/images/56114/03/561140333.jpg",
                "Встреча уполномоченного по правам человека в РФ Татьяны Москальковой с украинской коллегой Валерией \n"
                + "Лутковской может пройти ещё до конца июня, как ожидается, в рамках встречи российский и украинский \n"
                + "омбудсмены обсудят взаимодействие по гуманитарным вопросам");

        Article politica2 = new Article("ЦИК: выборы главы Кировской области могут пройти 18 сентября",
                "Досрочные выборы губернатора Кировской области в случае отставки Никиты Белых могут пройти 18 сентября, если будут назначены за 60 дней, то есть если в районе \n"
                + "18 июля будут основания для их назначения, сообщила секретарь ЦИК России Майя Гришина.\n"
                + "Секретарь ЦИК напомнила, что досрочные выборы могут проходить, в том числе, по сокращенному календарю — в течение 60 дней.\n"
                + "\"За 60 дней до 18 сентября — это где-то порядка 18 июля. То есть, если будут основания для назначения выборов в этот срок, то они могут быть проведены\", \n"
                + "— уточнила она.\n"
                + "При этом Гришина пояснила, что сложностей с организацией досрочных выборов в этом случае не возникнет.\n"
                + "\"Это нормальный законный срок, комиссии на постоянной основе работают, это их функции. С точки зрения организации выборов, это, естественно, требует и средств на внеочередную кампанию, и организационных мер. Но непреодолимого тут ничего нет: все штатно для избирательных комиссий,"
                + " они готовы всегда проводить избирательные кампании, если они назначены\", — добавила собеседница агентства", authorProfile,
                "http://cdn12.img22.ria.ru/images/145113/28/1451132833.jpg",
                "Досрочные выборы губернатора Кировской области в случае отставки Никиты Белых могут пройти 18 сентября, если будут назначены за 60 дней, то есть если в районе \n"
                + "18 июля будут основания для их назначения, сообщила секретарь ЦИК России Майя Гришина.\n");

        Article politica3 = new Article("Зюганов на съезде КПРФ заявил о росте авторитета Ленина",
                "Лидер КПРФ Геннадий Зюганов на предвыборном съезде партии в субботу заявил, что в российском обществе растет уважение к Ленину и Сталину, что либеральный лагерь развернул внутренний фронт против России \n"
                + "и что \"неолиберальная политика\" правительства исчерпала себя.\n"
                + "На субботнем съезде КПРФ должна утвердить предвыборную программу и выдвинуть кандидатов в Госдуму.\n"
                + "\"Острые социальные экономические проблемы соединились с попыткам отравить духовную атмосферу. Пятая колонна продолжает гнать мутную волну русофобии и антисоветизма. Но народ оказался мудрее и сильнее озлобленной пропаганды. Вот почему грязные потоки не пристают к советскому наследию. Новые поколения наших соотечественников открывают для себя величие и свершение страны советов, \n"
                + "а уважение к Ленинину и Сталину только растет\", — сказал Зюганов.\n"
                + "Лидер КПРФ в очередной раз раскритиковал работу кабмина. \"Неолиберальная политика правительства Медведева исчерпала себя и ведёт страну к краху. За последнюю четверть века Россию вынудили проводить безудержную приватизацию, согласиться с господством доллара, но это так и не привело к интеграции страны\", \n"
                + "— продолжил он и заявил, что действия власти провоцируют раскол и рост напряженности в обществе.", authorProfile,
                "http://cdn11.img22.ria.ru/images/106058/03/1060580342.jpg",
                "Лидер КПРФ Геннадий Зюганов на предвыборном съезде партии в субботу заявил, что в российском обществе растет уважение к Ленину и Сталину, что либеральный лагерь развернул внутренний фронт против России \n"
                + "и что \"неолиберальная политика\" правительства исчерпала себя.");

        Article politica4 = new Article("В КПРФ обещают, что при выдвижении кандидатов от партии скандалов не будет",
                "Глава предвыборного штаба КПРФ Иван Мельников заявил, что на предвыборном съезде коммунистов не будет скандалов, ведь все кандидатуры, в\n"
                + "ыдвигаемые на выборах в Госдуму, обсуждались много месяцев.\n"
                + "Он отметил, что накануне КПРФ провела пленум, где обсудила каждую из 225 кандидатур по одномандатным округам. \"И по всем 225 округам мы выдвигаем своих кандидатов. И примерно 400 кандидатов по партийным спискам\", — заявил глава штаба.\n"
                + "Выборы депутатов седьмого созыва Госдумы состояться 18 сентября, соответствующий указ на прошлой неделе подписал президент РФ Владимир Путин. Депутаты будут избираться по смешанной избирательной системе, отмененной в 2007 году и восстановленной в 2013: 225 депутатов будут избраны по партийным спискам (пропорциональная система)\n"
                + " и 225 — по одномандатным округам (мажоритарная система).", authorProfile,
                "http://cdn14.img22.ria.ru/images/132794/09/1327940945.jpg",
                "Глава предвыборного штаба КПРФ Иван Мельников заявил, что на предвыборном съезде коммунистов не будет скандалов, ведь все кандидатуры, в\n"
                + "ыдвигаемые на выборах в Госдуму, обсуждались много месяцев.\n");

        Article politica5 = new Article("Писатель Шаргунов будет баллотироваться от КПРФ в Челябинской области",
                "Писатель Сергей Шаргунов будет баллотироваться от КПРФ в одном из одномандатных округов в Челябинской области, такое решение утвердил партийный съезд.\n"
                + "Шаргунов также возглавил список КПРФ в Алтайском крае.\n"
                + "В целом КПРФ выдвинула 225 кандидатов по одномандатным округам и 400 человек в федеральный список.\n"
                + "Также на съезде была принята предвыборная программа партии \"10 шагов к достойной жизни\".\n"
                + "Выборы депутатов седьмого созыва Госдумы состоятся 18 сентября. Депутаты будут избираться по смешанной избирательной системе, отмененной в 2007 году и восстановленной в 2013-м: 225 депутатов будут избраны по партийным спискам (пропорциональная система) \n"
                + "и 225 — по одномандатным округам (мажоритарная система).", authorProfile,
                "http://cdn14.img22.ria.ru/images/132794/09/1327940945.jpg",
                "Писатель Сергей Шаргунов будет баллотироваться от КПРФ в одном из одномандатных округов в Челябинской области, такое решение утвердил партийный съезд.\n"
                + "Шаргунов также возглавил список КПРФ в Алтайском крае.\n");

        Article politica6 = new Article("Пушков: попытки найти российский след в Brexit - пропагандистские фантазии",
                "В четверг в Великобритании прошел референдум по членству страны в ЕС. Согласно официальным данным, за выход из Евросоюза проголосовали 51,9%. Премьер Британии Дэвид Кэмерон решил подать в октябре в отставку. Он оставляет следующему премьеру право последовать волеизъявлению граждан и выйти из Союза.\n"
                + "\"Попытки объявить голосование за Brexit \"победой Путина\" — пропагандистские фантазии, симптом \"электрошока\" после поражения Обамы и Брюсселя\",\n"
                + " — написал политик в Twitter.\n"
                + "Президент России Владимир Путин ранее заявил, что слова премьер-министра Великобритании \n"
                + "Дэвида Кэмерона о заинтересованности России в выходе Британии из Евросоюза не имеют и не имели"
                + " под собой никаких оснований, это попытка влияния на мнение людей в собственной стране.", authorProfile,
                "http://cdn11.img22.ria.ru/images/139075/16/1390751697.jpg",
                "В четверг в Великобритании прошел референдум по членству страны в ЕС. "
                + "Согласно официальным данным, за выход из Евросоюза проголосовали 51,9%. "
                + "Премьер Британии Дэвид Кэмерон решил подать в октябре в отставку. Он оставляет следующему премьеру право последовать волеизъявлению граждан и выйти из Союза.\n");

        Article economica1 = new Article("Баку заявил, что \"Южный газовый коридор\" позволит заработать $30-50 млрд",
                "Реализация проекта \"Южный газовый коридор\" (ЮГК) позволит Азербайджану заработать порядка 30-50 миллиардов долларов от продажи и транспортировки углеводородов, заявил исполнительный директор Госнефтефонда Азербайджана (SOFAZ) Шахмар Мовсумов, отметив, что это предварительные данные.\n"
                + "В Азербайджане уверяют, что \"Южный газовый коридор\" будет реализован в срок\n"
                + "ЮГК является одним из приоритетных для ЕС проектов и предусматривает транспортировку 10 миллиардов кубометров азербайджанского газа из Каспийского региона через Грузию и Турцию в Европу. На первоначальном этапе газ, который будет добываться в рамках второй фазы разработки азербайджанского газоконденсатного месторождения \"Шах Дениз\", рассматривается в качестве основного источника для проектов \"Южного газового коридора\". На более позднем этапе к проекту могут быть подключены другие источники.\n"
                + "\"ЮГК — широкомасштабный инфраструктурный и энергетический проект Европы. Гигантские газовые ресурсы Азербайджана, в особенности газоконденсатное месторождение \"Шах Дениз\", пока что являются единственным источником для ЮГК. Это одно из самых больших газовых месторождений мира. Реализация проекта \"Южный газовый коридор\" (ЮГК) позволит Азербайджану заработать порядка 30-50 миллиардов\", — цитирует Мовсумова агентство Тренд.\n"
                + "Глава SOFAZ отметил, что реализация ЮГК также направлена на долгосрочное развитие экономики Азербайджана. \"ЮГК создаст дополнительные экономические и финансовые возможности для страны и обеспечит прибыль и приток иностранной валюты на десятилетия\", — добавил он.\n"
                + "Как уточняет агентство, стоимость проекта ЮГК оценивается в 40 миллиардов долларов (ранее было 45-48 миллиардов долларов), в том числе стоимость проектов \"Шах Дениз-2\" снизилась до 23,8 миллиарда долларов, увеличения пропускной способности Южнокавказского газопровода – до 4,9 миллиарда долларов, строительства TANAP –\n"
                + " с 11 миллиардов до 9,3 миллиарда долларов, TAP – до 6 миллиардов долларов.", authorProfile,
                "http://cdn11.img22.ria.ru/images/144151/42/1441514277.jpg",
                "Реализация проекта \"Южный газовый коридор\" (ЮГК) позволит Азербайджану заработать порядка 30-50 миллиардов долларов от продажи и транспортировки углеводородов, заявил исполнительный директор Госнефтефонда "
                + "Азербайджана (SOFAZ) Шахмар Мовсумов, отметив, что это предварительные данные.");

        Article economica2 = new Article("Париж заявил о невозможности заключения соглашения по TTIP с США",
                "Премьер-министр Франции Мануэль Вальс заявил в воскресенье о невозможности соглашения по трансатлантическому торгово-инвестиционному партнерству между ЕС и США, если оно не учитывает интересы Евросоюза, сообщает агентство Франс Пресс.\n"
                + "Экономист о TTIP: США плотно вцепились в Европу и не выпустят ее\n"
                + "Евросоюз с июля 2013 года ведет переговоры с США относительно Трансатлантического соглашения о \n"
                + "партнерстве в области торговли и инвестиций (TTIP). Речь идет о создании самой большой в мире зоны беспошлинной \n"
                + "торговли с потребительским рынком около 820 миллионов человек.\n"
                + "\"Отныне никакого соглашения о свободной торговле не должно быть заключено, если оно не соблюдает интересы Евросоюза. Европа должна быть твердой. Франция будет за этим следить. И я вам откровенно говорю, что соглашения "
                + "о трансатлантической торговле быть не может. Это соглашение идет в неправильном направлении\","
                + " — заявил премьер-министр.", authorProfile,
                "http://cdn12.img22.ria.ru/images/56114/03/561140333.jpg",
                "Премьер-министр Франции Мануэль Вальс заявил в воскресенье о невозможности соглашения по трансатлантическому торгово-инвестиционному партнерству между ЕС и США, если оно не учитывает интересы Евросоюза, сообщает агентство Франс Пресс.\n"
                + "Экономист о TTIP: США плотно вцепились в Европу и не выпустят ее...\n");

        Article economica3 = new Article("Президент ОАК назвал важнейшую цель корпорации",
                "Президент Объединенной авиастроительной корпорации (ОАК) Юрий Слюсарь заявил, что отечественные производители сначала должны научиться делать полностью конкурентоспособные гражданские самолеты, только после этого у россиян появится возможность ими воспользоваться.\n"
                + "По его словам, пока надо четко понимать, что \"мы на рынке практически сложившегося этого поля Boеing и Airbus никому не нужны\".\n"
                + "\"Мы делаем крайне конкурентноспособные военные самолеты. Операция в Сирии показала не в презентации, не на полигоне, что нам в этом смысле нет равных\", — добавил Слюсарь. ОАК надеется, что модернизировав, заменив парк на современные стратегические, боевые, транспортные самолеты, корпорация будет видеть большие перспективы на внешних рынках.\n"
                + "\"Мы реально востребованы, мы живы, мы конкурентоспособны, мы развиваемся, нам есть что показать, но гораздо более амбициозная задача стоит перед нами в гражданском секторе\", — резюмировал глава корпорации.", authorProfile,
                "http://cdn14.img22.ria.ru/images/145232/23/1452322365.jpg",
                "Президент Объединенной авиастроительной корпорации (ОАК) Юрий Слюсарь заявил, что отечественные производители сначала должны научиться делать полностью конкурентоспособные гражданские самолеты, только после этого у россиян появится возможность ими воспользоваться.\n"
                + "По его словам, пока надо четко понимать, что \"мы на рынке практически сложившегося этого поля Boеing и Airbus никому не нужны\".\n");

        Article economica4 = new Article("Британия надеется на доступ к единому рынку Евросоюза после Brexit",
                "МИД Великобритании надеется, что Соединенное Королевство сохранит доступ к единому рынку Евросоюза после выхода страны из ЕС, заявил глава \n"
                + "британского внешнеполитического ведомства Филип Хаммонд.\n"
                + "\"Потеря доступа к единому рынку стала бы катастрофой\", — сказал министр в воскресенье.\n"
                + "В четверг граждане Великобритании на референдуме проголосовали за выход их страны из ЕС. \n"
                + "Теперь Британия должна уведомить Брюссель о своем решении, после чего начнется двухлетний переговорный процесс, в ходе которого будет заключено соглашение о выходе. Британия настаивает на включение в это соглашение пунктов о свободе передвижения и доступе к единому рынку ЕС. "
                + "Без этого, по мнению экспертов, парламент Соединенного Королевства не ратифицирует соглашение.", authorProfile,
                "http://cdn11.img22.ria.ru/images/144982/42/1449824227.jpg",
                "МИД Великобритании надеется, что Соединенное Королевство сохранит доступ к единому рынку Евросоюза после выхода страны из ЕС, заявил глава \n"
                + "британского внешнеполитического ведомства Филип Хаммонд.\n");

        Article economica5 = new Article("Moodys снизило прогноз кредитного рейтинга Британии из-за Brexit",
                "Международное рейтинговое агентство Moodys первым из рейтинговых агентств снизило прогноз кредитного рейтинга Великобритании из-за выхода страны из ЕС, однако может его повысить в случае заключения новых торговых соглашений с ЕС, следует из сообщения агентства.\n"
                + "Прогноз со \"стабильного\" до \"негативного\" снижен по рейтингу долгосрочного эмитента и долгового рейтинга. \n"
                + "При этом оба рейтинга подтверждены на уровне \"Аа1\".\n"
                + "Как поясняется в сообщении агентства, поводом для снижения прогноза послужили результаты референдума по Brexit,\n"
                + " которые означают для экономики Великобритании длительный период неопределенности с негативной реализацией среднесрочного прогноза по росту экономики.\n"
                + " Еще одна причина, побудившая агентство снизить прогноз по рейтингам, в том, что в результате итогов референдума повысился риск снижения политики предсказуемости и эффективности.\n"
                + "Также в агентстве считают, что Brexit негативно отразится на возможности британского правительства реализовывать фискальную политику, в частности — ранее запланированные многолетние программы. Это приведет к более низким доходам и более высоким расходам.\n"
                + "Согласно пессимистическому сценарию агентства, сокращение дефицита британского бюджета может быть парализовано и государственный долг вырастет с текущих уровней.", authorProfile,
                "http://cdn13.img22.ria.ru/images/145071/59/1450715964.jpg",
                "Международное рейтинговое агентство Moodys первым из рейтинговых агентств снизило прогноз кредитного рейтинга Великобритании из-за выхода страны из ЕС, однако может его повысить в случае заключения новых торговых соглашений с ЕС, следует из сообщения агентства.\n"
                + "Прогноз со \"стабильного\" до \"негативного\" снижен по рейтингу долгосрочного эмитента и долгового рейтинга. \n"
        ");

Article economica6 = new Article("Биржи США закрылись снижением на 0,2% на новостях от ФРС",
                "Основные американские фондовые индексы в среду закрылись в \"красной\" зоне на фоне решения ФРС по ставке, свидетельствуют данные торгов.\n"
                + "Промышленный индекс Dow Jones уменьшился на 0,2% — до 17640,17 пункта, индекс высокотехнологичных компаний NASDAQ — на 0,18%, до 4834,93 пункта, \n"
                + "индекс широкого рынка S&P 500 — на 0,18%, до 2071,50 пункта.\n"
                + "В среду ФРС США по итогам июньского заседания сохранила базовую процентную ставку на уровне 0,25-0,5% годовых, отметив неоднозначность опубликованных в последние недели макроэкономических данных. Кроме того, ФРС ухудшила прогноз по росту экономики страны в 2016 году до 2% с мартовских 2,2%.\n"
                + "В июне регулятор сохранил прогноз по повышению ставки в 2016 году до среднего уровня в 0,9%, ожидая, таким образом, два повышения до конца текущего года. В декабре 2015 года глава ФРС Джанет Йеллен сообщила о планах довести базовую ставку до 1,5% в 2016 году и до 2,5% — в 2017 году.\n"
                + "\"Реакция рынка была нейтральной, поскольку заявление (ФРС) подтверждает, что повышения ставки не будет ни в июне, ни в июле. Между тем, тот факт, что ФРС больше обеспокоена замедлением экономического роста и тем, что эта задержка не временная, не является позитивным для акций\", — сказал агентству MarketWatch старший экономист TIAA Global Asset Management Тим Хоппер (Tim Hopper).\n"
                + "Хуже прогнозов оказалась опубликованная в среду внутренняя статистика. Так промышленное производство в США в мае снизилось в месячном выражении на 0,4%. Аналитики прогнозировали снижение показателя на 0,2%. "
                + "Загрузка промышленных мощностей в мае составила 74,9% при ожиданиях экспертов показателя на уровне 75,2%.", authorProfile,
                "http://cdn11.img22.ria.ru/images/134367/43/1343674372.jpg",
                "Основные американские фондовые индексы в среду закрылись в \"красной\" зоне на фоне решения ФРС по ставке, свидетельствуют данные торгов.\n"
                + "Промышленный индекс Dow Jones уменьшился на 0,2% — до 17640,17 пункта, индекс высокотехнологичных компаний NASDAQ — на 0,18%, до 4834,93 пункта, \n"
                + "индекс широкого рынка S&P 500 — на 0,18%, до 2071,50 пункта.\n");

        Article other1 = new Article("Ученые установили зависимость между климатом и уровнем преступности",
                "Исследователи нашли прямую зависимость между температурой воздуха и уровнем преступности, пишет журнал Behavior and Brain Sciences.\n"
                + "Уровень преступности по всему миру различается, но существует общее правило, согласно которому насилие и агрессия увеличиваются по мере приближения к экватору. Таким образом, полагают ученые, климат влияет на поведение людей.\n"
                + "Жара, считают исследователи, приводит к тому, что люди живут \"одним днем\" и уделяют мало внимания своему будущему. "
                + "В этом случае уменьшение самоконтроля способствует увеличению агрессии и насилия..", authorProfile,
                "http://cdn14.img22.ria.ru/images/139212/23/1392122395.jpg",
                "Исследователи нашли прямую зависимость между температурой воздуха и уровнем преступности, "
                + "пишет журнал Behavior and Brain Sciences.\n");

        Article other2 = new Article("Ученые близки к открытию того, почему люди становятся злыми или добрыми",
                "Математики из Великобритании создали компьютерную модель, которая показывает, что некоторые люди могут быть генетически запрограммированы на доброе поведение, а другие из-за особенностей в устройстве ДНК становятся злодеями, говорится в статье, опубликованной в журнале PLoS Computational Biology.\n"
                + "Считается, что большинство млекопитающих, кроме человека и некоторых высших приматов, не склонны помогать своим соплеменникам и не поддерживают дружеские связи вне своей стаи. За последние годы ученые провели множество \"тестов на альтруизм\" с участием шимпанзе, некоторых других обезьян, а также младенцев и детей.\n"
                + "Часть экспериментов показала, что обезьяны способны помогать окружающим бескорыстно, другие подтвердили \"животный эгоизм\" приматов. С другой стороны, дети приобретают чувство альтруизма уже в 15 месяцев, что говорит о чрезвычайной важности подобной психологической черты  — умения быть добрым по отношению к окружающим – для эволюции и выживания человечества. По этой причине ученые активно пытаются понять, что толкает человека в сторону помощи ближнему, изучая поведение разных животных и даже бактерий.\n"
                + "Саша Долл (Sasha Dall) из университета Эксетера (Великобритания), математик по образованию, и его коллеги заявляют, что им удалось создать математическую модель, объясняющую существование не только добрых, но и злых людей в нашем обществе, наблюдая за поведением \"коллективных\" форм микробов.\n"
                + "Как рассказывают ученые, в нашем обществе и среди животных есть как ярко выраженные нахлебники, так и альтруисты, которые относительно мирно живут друг с другом, несмотря на нещадную эксплуатацию вторых первыми. В их существовании, как полагают авторы статьи, замешаны генетические факторы, толкающие человека в сторону эгоизма или альтруизма.\n"
                + "Модель, подготовленная Доллом и его коллегами, показывает, что подобное поведение действительно может быть обусловлено различиями в устройстве одного или нескольких генов,  и что все черты во взаимодействии и манере действий генетически добрых и злых людей можно воспроизвести при помощи компьютера, в том числе и их \"мирное сосуществование\" друг с другом.\n"
                + "\"Теория социальной эволюции никогда не учитывала возможность того, что на наше поведение может влиять генетический полиморфизм и изменчивость. Мы разработали модель, которая позволила нам проверить и доказать это, и теперь мы надеемся подтвердить данные выводы экспериментальным путем, в ходе опытов на животных или микробах\", "
                + "— заключает Олоф Леймар (Olof Leimar) из Стокгольмского университета (Швеция).", authorProfile,
                "http://cdn11.img22.ria.ru/images/99339/42/993394257.jpg",
                "Математики из Великобритании создали компьютерную модель, которая показывает, что некоторые люди могут быть генетически запрограммированы на доброе поведение, а другие из-за особенностей в устройстве ДНК становятся "
                + "злодеями, говорится в статье, опубликованной в журнале PLoS Computational Biology.\n");

        Article other3 = new Article("В Торфянке не дают построить храм, но используют часть парка под дорогу",
                "Местные жители, выступающие против строительства храма в парке Торфянка, не протестуют против решения уничтожить 0,3 гектара парка под строительство нового проезда, заявила в пятницу муниципальный депутат Бабушкинского района Марина Овчинникова на пресс-конференции,\n"
                + "посвященной предстоящему 26 июня молебну сторонников строительства храма.Результаты общественных слушаний и проект проезда размещены на сайте управы Лосиноостровского района. По итогам слушаний было принято решение одобрить строительство. Согласно протоколу публичных слушаний, один из присутствующих заявил, что строительство нового проезда неприемлемо, так как при этом будут уничтожены часть придомовых территорий, парка и детских площадок. Однако окружная комиссия пришла к выводу, \n"
                + "что данное замечание \"не является предметом рассмотрения\" и одобрила проект.Как заметила активистка общины храма Казанской иконы Божией Матери в парке Торфянка Лада Савонина, правительство Москвы оттягивает решение по строительству храма в Торфянке в связи с тем, что сейчас идет предвыборный период.\n"
                + " \"Чтобы избежать потенциальных всплесков общественности, нам предложили отложить решение по храму до окончания выборного периода — до сентября 2016 года\", — заявила активистка.", authorProfile,
                "http://cdn11.img22.ria.ru/images/145107/03/1451070367.jpg",
                "Местные жители, выступающие против строительства храма в парке Торфянка, не протестуют против решения уничтожить 0,3 гектара парка под строительство нового проезда, заявила в пятницу муниципальный депутат Бабушкинского района Марина Овчинникова на пресс-конференции...\n");

        Article other4 = new Article("Папа римский назвал прием в Армении \"горячим и сердечным",
                "Папа римский Франциск, выступая с приветственной речью в кафедральном соборе Первопрестольного Святого Эчмиадзина, назвал прием в Армении \"горячим и сердечным\".\n"
                + "\"Такой знак любви разъясняет гораздо красноречивей слов, что означают братская дружба и любовь… С волнением я переступил порог этого священного места, свидетеля истории вашего народа, живого сердца его духовности;\n"
                + "и драгоценным даром Божиим почитаю я возможность приблизиться к священному алтарю, с которого просиял свет Христов в Армении\", — сказал глава Римско-католической церкви, в пятницу прибывший в Армению с трехдневным визитом.\n"
                + "\"Я склоняюсь перед милосердием Господа, пожелавшим, чтобы Армения стала первой нацией, принявшей начиная с 301 года христианство как свою религию, в то самое время, когда в Римской империи еще бушевали гонения\", — сказал папа римский.\n"
                + "Он отметил, что \"вера во Христа никогда не была для Армении неким подобием плаща, который можно накинуть или снять в соответствии с обстоятельствами или удобствами; вера была определяющей реальностью ее самобытности, огромным даром, который \n"
                + "она приняла с радостью и хранила с усердием и решительностью, ценой самой жизни\".\n"
                + "Понтифик также отметил важность искреннего и братского диалога между Католической и Армянской апостольской церквями с целью достичь полноты общения в Евхаристической трапезе. \"Святой Дух да поможет нам осуществить то единство, о котором молил Господь наш, дабы ученики его были едины и уверовал мир\","
                + " — сказал папа Франциск, благословив армянский народ.", authorProfile,
                "http://cdn13.img22.ria.ru/images/145104/75/1451047569.jpg",
                "Папа римский Франциск, выступая с приветственной речью в кафедральном соборе Первопрестольного Святого Эчмиадзина, назвал прием в Армении \"горячим и сердечным\".\n"
                + "\"Такой знак любви разъясняет гораздо красноречивей слов, что означают братская дружба и любовь… ");

        Article other5 = new Article("Суд отказался признавать хит Led Zeppelin \"Stairway to Heaven\" плагиатом",
                "На прошлой неделе в Лос-Анджелесе начались слушания по делу против британской рок-группы Led Zeppelin, которую подозревали в плагиате при создании песни Stairway to Heaven.\n"
                + "Истцы считали, что вступление к этой композиции похоже на вступление песни Taurus американской группы Spirit, написанной в 1968 году.\n"
                + "Иск против Led Zeppelin и их звукозаписывающей компании Warner Music был подан в мае 2014 года. Истцом в отношении британского коллектива выступал адвокат Майкл Скидмор, представляющий интересы автора \n"
                + "Taurus, американского певца и гитариста Рэнди Вулфи, погибшего в 1997 году.\n"
                + "В свою очередь музыканты и их записывающая компания отрицали все обвинения и заявляли, что Роберт Плант и Джимми Пейдж сами написали песню в 1971 году.\n"
                + "Солист Led Zeppelin отверг обвинения в плагиате песни Stairway to Heaven\n"
                + "Присяжные признали, что у вокалиста Led Zeppelin Роберта Планта и у гитариста Джимми Пейджа был доступ к песне Taurus в 1968 году, но сочли песни недостаточно похожими, чтобы подтвердить факт плагиата.\n"
                + "\n"
                + "В понедельник защита Led Zeppelin также потребовала у суда прекращения процесса, заявив, что истцы не смогли предоставить существенных"
                + " доказательств своих претензий на авторство популярной композиции легендарной группы.", authorProfile,
                "http://cdn12.img22.ria.ru/images/145074/92/1450749248.jpg",
                "На прошлой неделе в Лос-Анджелесе начались слушания по делу против британской рок-группы Led Zeppelin, которую подозревали в плагиате при создании песни Stairway to Heaven.\n"
                + "Истцы считали, что вступление к этой композиции похоже на вступление песни Taurus американской группы Spirit, написанной в 1968 году.\n");

        Article other6 = new Article("Театральные премьеры июля: \"Анна Каренина\" и \"Осуждение Фауста\"",
                "Мариинский театр представит целых три премьеры – одну балетную и две оперные, это настоящий рекорд для июля.\n"
                + "Балетная премьера посвящена Сергею Прокофьеву. Молодые хореографы театра представят в один вечер два одноактных балета на музыку композитора. Максим Петров покажет \"Русскую увертюру\", а Антон Пимонов — \"Скрипичный концерт №2\".\n"
                + " В этот же вечер к этим двум работам присоединится балет \"Блудный сын\" Джорджа Баланчина – модернистское произведение ХХ века. Таким образом, новые работы молодых оказываются \"под присмотром\" классика ХХ века, который в пору создания \"Блудного сына\" был 25-летним юношей – ровесником хореографов – авторов балетов на музыку Прокофьева.\n"
                + " Премьера состоится 4 и 17 июля на сцене Мариинский-2.\n"
                + "В рамках фестиваля \"Звезды белых ночей\" 6 и 9 июля состоится премьера оперы \"Идиот\" Мечислава Вайнберга по одноименному роману Достоевского. За дирижерский пульт встанет Томас Зандерлинг. В главных партиях выступят солисты театра и Академии молодых оперных певцов \"Мариинки\".\n"
                + "Завершит фестиваль мировая премьера оперы современного композитора Леонида Клиничева \"Казаки\", созданной специально для Академии молодых оперных певцов под руководством Ларисы Гергиевой. "
                + "Премьера состоится 24 июля в Концертном зале Мариинского театра.", authorProfile,
                "http://cdn15.img22.ria.ru/images/144964/31/1449643186.jpg",
                "Мариинский театр представит целых три премьеры – одну балетную и две оперные, это настоящий рекорд для июля.\n"
                + "Балетная премьера посвящена Сергею Прокофьеву. Молодые хореографы театра представят в один вечер два одноактных балета на музыку композитора. Максим Петров покажет \"Русскую увертюру\", а Антон Пимонов — \"Скрипичный концерт №2\".\n");
        articleComments.add(new Comment("amazing text1", authorProfile, article8));
        articleComments.add(new Comment("amazing text2", authorProfile, article8));
        article.setCommentaries(articleComments);
        List<Article> articles = new ArrayList<>();
        articles.add(article8);
        articles.add(article9);
        articles.add(article10);
        articles.add(art1);
        articles.add(art2);
        articles.add(art3);
        articles.add(art4);
        articles.add(art5);
        articles.add(art6);
        articles.add(art7);
        articles.add(art8);
        articles.add(art9);
        articles.add(art10);
        articles.add(art11);
        articles.add(art12);
        articles.add(art13);
        articles.add(art14);
        articles.add(art15);
        articles.add(politica1);
        articles.add(politica2);
        articles.add(politica3);
        articles.add(politica4);
        articles.add(politica5);
        articles.add(politica6);
        articles.add(economica1);
        articles.add(economica2);
        articles.add(economica3);
        articles.add(economica4);
        articles.add(economica5);
        articles.add(economica6);
        articles.add(other1);
        articles.add(other2);
        articles.add(other3);
        articles.add(other4);
        articles.add(other5);
        articles.add(other6);
        List<Like> articleLikes = new ArrayList<>();
        Like like1 = new Like(1);
        like1.setLeftByAuthor(authorProfile);
        like1.setLeftOnArticle(article8);
        articleLikes.add(like1);
        Like like2 = new Like(-1);
        like2.setLeftByAuthor(authorProfile);
        like2.setLeftOnArticle(article8);
        articleLikes.add(like2);
        article.setLikes(articleLikes);
        List<Tag> articleTags = new ArrayList<>();
        Tag sport = new Tag("sport");
        ArrayList<Article> listSport = new ArrayList();
        listSport.add(article8);
        listSport.add(article9);
        listSport.add(article10);
        listSport.add(art1);
        listSport.add(art2);
        listSport.add(art3);
        sport.setBelongsToArticles(listSport);
        articleTags.add(sport);
        Tag culture = new Tag("culture");
        ArrayList<Article> listCulture = new ArrayList();
        listCulture.add(art4);
        listCulture.add(art5);
        listCulture.add(art6);
        listCulture.add(art7);
        listCulture.add(art8);
        listCulture.add(art9);
        culture.setBelongsToArticles(listCulture);
        articleTags.add(culture);
        Tag society = new Tag("society");
        ArrayList<Article> listSociety = new ArrayList();
        listSociety.add(art10);
        listSociety.add(art11);
        listSociety.add(art12);
        listSociety.add(art13);
        listSociety.add(art14);
        listSociety.add(art15);
        society.setBelongsToArticles(listSociety);
        articleTags.add(society);
        Tag policy = new Tag("policy");
        ArrayList<Article> listPolicy = new ArrayList();
        listPolicy.add(politica1);
        listPolicy.add(politica2);
        listPolicy.add(politica3);
        listPolicy.add(politica4);
        listPolicy.add(politica5);
        listPolicy.add(politica6);
        policy.setBelongsToArticles(listPolicy);
        articleTags.add(policy);
        Tag economy = new Tag("economy");
        ArrayList<Article> listEconomy = new ArrayList();
        listEconomy.add(economica1);
        listEconomy.add(economica2);
        listEconomy.add(economica3);
        listEconomy.add(economica4);
        listEconomy.add(economica5);
        listEconomy.add(economica6);
        economy.setBelongsToArticles(listEconomy);
        articleTags.add(economy);
        Tag other = new Tag("other");
        ArrayList<Article> listOther = new ArrayList();
        listOther.add(other1);
        listOther.add(other2);
        listOther.add(other3);
        listOther.add(other4);
        listOther.add(other5);
        listOther.add(other6);
        other.setBelongsToArticles(listOther);
        articleTags.add(other);
        article8.setArticleTags(articleTags);
        articleRepository.save(articles);
    }
}